RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_tzc_sec.c
/**
  ******************************************************************************
  * @file    bl808_tzc_sec.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "string.h"
#include "bl808_tzc_sec.h"
#include "bl808_glb.h"

/** @addtogroup  BL808_Peripheral_Driver
 *  @{
 */

/** @addtogroup  TZC_ENG
 *  @{
 */

/** @defgroup  TZC_ENG_Private_Macros
 *  @{
 */

/*@} end of group TZC_ENG_Private_Macros */

/** @defgroup  TZC_ENG_Private_Types
 *  @{
 */

/*@} end of group TZC_ENG_Private_Types */

/** @defgroup  TZC_ENG_Private_Variables
 *  @{
 */

/*@} end of group TZC_ENG_Private_Variables */

/** @defgroup  TZC_ENG_Global_Variables
 *  @{
 */

/*@} end of group TZC_ENG_Global_Variables */

/** @defgroup  TZC_ENG_Private_Fun_Declaration
 *  @{
 */

/*@} end of group TZC_ENG_Private_Fun_Declaration */

/** @defgroup  TZC_ENG_Private_Functions
 *  @{
 */

/*@} end of group TZC_ENG_Private_Functions */

/** @defgroup  TZC_ENG_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  None
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void Tzc_Sec_Set_Sboot_Done(void)
{
    uint32_t tmpVal;
    /* Set Sboot done */
    tmpVal = BL_RD_REG(TZ1_BASE, TZC_SEC_TZC_ROM_TZSRG_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TZC_SEC_TZC_SBOOT_DONE, 0xf);
    BL_WR_REG(TZ1_BASE, TZC_SEC_TZC_ROM_TZSRG_CTRL, tmpVal);
}

void Tzc_Sec_Set_Master_Group(TZC_SEC_Master_Type masterType, uint8_t group)
{
    uint32_t tmpVal;
    uint32_t tmpVal2;

    if (masterType < TZC_SEC_MASTER_D0) {
        tmpVal = BL_RD_REG(TZ1_BASE, TZC_SEC_TZC_BMX_TZMID);
        tmpVal2 = BL_RD_REG(TZ1_BASE, TZC_SEC_TZC_BMX_TZMID_LOCK);

        if (group == 0) {
            tmpVal &= (~(1 << masterType));
        } else {
            tmpVal |= (1 << masterType);
        }
        tmpVal |= (1 << (masterType + 16));
        tmpVal2 |= (1 << masterType);

        BL_WR_REG(TZ1_BASE, TZC_SEC_TZC_BMX_TZMID, tmpVal);
        BL_WR_REG(TZ1_BASE, TZC_SEC_TZC_BMX_TZMID_LOCK, tmpVal2);
    } else {
        masterType -= TZC_SEC_MASTER_D0;

        tmpVal = BL_RD_REG(TZ1_BASE, TZC_SEC_TZC_MM_BMX_TZMID);
        tmpVal2 = BL_RD_REG(TZ1_BASE, TZC_SEC_TZC_MM_BMX_TZMID_LOCK);

        if (group == 0) {
            tmpVal &= (~(1 << masterType));
        } else {
            tmpVal |= (1 << masterType);
        }
        tmpVal |= (1 << (masterType + 16));
        tmpVal2 |= (1 << masterType);

        BL_WR_REG(TZ1_BASE, TZC_SEC_TZC_MM_BMX_TZMID, tmpVal);
        BL_WR_REG(TZ1_BASE, TZC_SEC_TZC_MM_BMX_TZMID_LOCK, tmpVal2);
    }
}

void Tzc_Sec_Set_Slave_Group(TZC_SEC_Slave_Type slaveType, uint8_t group)
{
    uint32_t tmpVal;

    if (group > TZC_SEC_MAX_AUTH_GRP || slaveType >= TZC_SEC_SLAVE_MAX) {
        return;
    }
    group = 1 << (group);

    if (slaveType >= TZC_SEC_SLAVE_MM) {
        slaveType -= TZC_SEC_SLAVE_MM;
        tmpVal = BL_RD_REG(TZ1_BASE, TZC_SEC_TZC_BMX_S0);
        /* set group */
        tmpVal &= (~(3 << (slaveType * 2)));
        tmpVal |= (group << (slaveType * 2));
        /* set lock*/
        tmpVal |= (1 << (slaveType + 16));
        BL_WR_REG(TZ1_BASE, TZC_SEC_TZC_BMX_S0, tmpVal);
    } else if (slaveType < TZC_SEC_SLAVE_EMI_MISC) {
        slaveType -= TZC_SEC_SLAVE_GLB;
        tmpVal = BL_RD_REG(TZ1_BASE, TZC_SEC_TZC_BMX_S1);
        /* set group */
        tmpVal &= (~(3 << (slaveType * 2)));
        tmpVal |= (group << (slaveType * 2));
        BL_WR_REG(TZ1_BASE, TZC_SEC_TZC_BMX_S1, tmpVal);

        tmpVal = BL_RD_REG(TZ1_BASE, TZC_SEC_TZC_BMX_S_LOCK);
        /* set lock */
        tmpVal |= (1 << slaveType);
        BL_WR_REG(TZ1_BASE, TZC_SEC_TZC_BMX_S_LOCK, tmpVal);
    } else {
        slaveType -= TZC_SEC_SLAVE_EMI_MISC;

        tmpVal = BL_RD_REG(TZ1_BASE, TZC_SEC_TZC_BMX_S2);
        /* set group */
        tmpVal &= (~(3 << (slaveType * 2)));
        tmpVal |= (group << (slaveType * 2));
        BL_WR_REG(TZ1_BASE, TZC_SEC_TZC_BMX_S2, tmpVal);

        tmpVal = BL_RD_REG(TZ1_BASE, TZC_SEC_TZC_BMX_S_LOCK);
        /* set lock */
        tmpVal |= (1 << (slaveType + TZC_SEC_SLAVE_EMI_MISC));
        BL_WR_REG(TZ1_BASE, TZC_SEC_TZC_BMX_S_LOCK, tmpVal);
    }
}

